[
  {
    "milestoneTitle": "Storia",
    "bad": false,
    "milestones": [
      {
        "items": null,
        "title": "Prima run",
        "unlock": "||Sblocca accesso ai piani successivi||",
        "description": "Finisci il gioco una volta"
      },
      {
        "items": null,
        "title": "Finisci il gioco 11 volte",
        "unlock": "||Sblocca accesso incondizionato ai piani successivi||",
        "description": "||Quando arrivi al cuore se hai accesso a un patto del diavolo o degli angeli potrai accedere a un ulteriore piano e fare anche il boss finale alternativo.|| Completare 11 run ti darà accesso a quanto detto senza patti."
      },
      {
        "items": [
          323,
          324
        ],
        "title": "Batti 5 volte ||Satan e Isaac||",
        "unlock": "Polaroid e The negative",
        "description": "Andando nei patti o, dopo aver vinto 11 volte, potrai sfidare ||the lamb o ???||. Battili 5 volte a testa per sbloccare Polaroid e The Negative"
      },
      {
        "items": null,
        "title": "Batti 1 volta ||the lamb|| o ||???||",
        "unlock": "Chiave per ||Mega Satan||",
        "description": "Battendo 1 volta uno dei due boss sbloccherà la possibilità di bombardare le statue degli angeli nel patto angelico. Bombardandola avrai la possibilità di ottenere il frammento di chiave. Facendolo due volte otterai la chiave completa e avrai accesso a una stanza alternativa nel piano The Chest ||(quello di Lamb e ???)||"
      },
      {
        "items": null,
        "title": "Batti Hush 1 volta",
        "unlock": "The void floor",
        "description": "Battendo ||il cuore di mamma|| in meno di 30 minuti ti darà accesso a un piano alternativo dove potrai sfidare ||Delirium||. "
      },
      {
        "items": null,
        "title": "Batti Hush 3 volte",
        "unlock": "||Piani alternativi dove poter sfidare The Mother||",
        "description": "||I primi due piani normali di qualsiasi run avranno ora una porta chiusa a chiave (richiede una chiave) nella stanza del boss, che conduce al primo piano alternativo, Downpour. Il terzo e quarto piano normale (e Downpour II) avranno invece una porta sbarrata (richiede 2 bombe) nella stanza del boss, che conduce al secondo piano alternativo, Mines.In Downpour II c’è un camino bianco da qualche parte nel piano e una stanza con uno specchio. Tocca il fuoco bianco per trasformarti temporaneamente in The Lost, poi attraversa lo specchio per accedere al mondo dello specchio. Nella stanza degli oggetti del mondo dello specchio troverai un pezzo del coltello. In Mines II ci sono 3 pulsanti gialli sparsi nel piano e una stanza con un carrello da miniera. Premi i pulsanti e poi sali sul carrello. Cammina fino alla fine del percorso per ottenere il secondo pezzo del coltello. La stanza del boss di Mines II avrà una porta speciale che richiede il pagamento di due cuori per essere aperta e conduce al terzo piano alternativo, Mausoleum. Sconfiggi la versione potenziata di Mom in Mausoleum II, usa il coltello completo sulla porta rossa nella stanza del boss e poi sconfiggi la versione potenziata del Cuore di Mom. Infine, torna nella stanza del boss di Mom e scendi nel buco per raggiungere il quarto piano alternativo, Corpse. Alla fine di Corpse II potrai combattere Mother.||"
      },
      {
        "items": null,
        "title": "Batti 1 volta ||The Mother||",
        "unlock": "Accesso al vero finale e ai personaggi alternativi",
        "description": "||La Strange Door si trova nella stanza iniziale di Depths II / Necropolis II (piano 6) e conduce infine a The Beast. Da qualche parte nel piano 6 ci sarà una roccia a forma di teschio con una X sopra, che può essere distrutta per ottenere una carta Fool. Dopo aver sconfitto Mom, usa la carta Fool per tornare alla Strange Door, che ora puoi aprire offrendo il Polaroid o il Negative. Entra e scendi nel buco per raggiungere il Mausoleum. La stanza del boss di questa versione del Mausoleum non avrà un boss, ma conterrà invece un oggetto chiamato Dad's Note. Una volta raccolto, inizierai a risalire i piani che avevi già completato durante la run. I piani sono più piccoli del normale e non hanno stanze speciali, eccetto le stanze degli oggetti (che non conterranno nuovi oggetti). Una volta tornato nella stanza iniziale del piano 1, puoi entrare nella luce per arrivare a Home. Dormi nel letto di Mom sul lato sinistro del piano, poi torna nel soggiorno per avviare la sequenza finale di boss, che termina con The Beast.||"
      }
    ]
  },
  {
    "milestoneTitle": "Runes",
    "bad": false,
    "milestones": [
      {
        "items": 941,
        "title": "Jera",
        "unlock": "Complete Challenge #2: High Brow",
        "description": "This is definitely the best rune in the game when factoring in how easy it is to unlock. Jera is immensely powerful in the hands of a good player and can be used to break the game under the right circumstances."
      },
      {
        "items": 942,
        "title": "Ehwaz",
        "unlock": "Complete Challenge #3: Head Trauma",
        "description": "In my opinion, Ehwaz is greatly underrated. An uninformed player probably just thinks that it creates a trapdoor to the next floor most of the time and rarely creates a crawlspace instead, but they'd be incorrect. In reality, it creates a trapdoor to the next floor on any normal tile and a crawlspace (normally containing an item or a black market) on any tile with a decoration on it. You can probably guess which one I normally use Ehwaz for. The challenge isn't too bad and is unlocked by default."
      },
      {
        "items": 945,
        "title": "Perthro",
        "unlock": "Complete Challenge #6: Solar System",
        "description": "I won't lie, this is one of the more difficult challenges and it isn't unlocked by default either. However, its challenge unlock is easier than most in the game and you'll get it just by playing normally without having to go out of the way. What you get from completing it is a one-time use D6, which, trust me, you'll be glad to have."
      },
      {
        "items": [
          948,
          259
        ],
        "title": "Blank Rune & Clear Rune",
        "unlock": "Complete Challenge #30: The Guardian",
        "description": "You may be wondering why I'm recommending you unlock Blank Rune. Well, for starters, it is a direct upgrade over a rune shard since it both triggers a stronger version of the rune effect and has a chance to duplicate itself upon use. Unlocking Blank Rune is also the only way to gain access to Clear Rune, a rare but useful item that can be used to break the game. The challenge isn't too bad, in my opinion, and gets unlocked very early on."
      },
      {
        "items": 944,
        "title": "Ansuz",
        "unlock": "Complete Challenge #5: The Tank",
        "description": "You'll probably unlock The Tank early enough in the game just by doing a run or two as Magdalene. It's an easy enough challenge, if a bit boring, and Ansuz is an alright rune that shows you where your secret rooms are. Pretty cool."
      },
      {
        "items": 947,
        "title": "Algiz",
        "unlock": "Complete Challenge #8: Cat Got Your Tongue",
        "description": "This challenge is quite tricky, but since you can unlock it fast just by becoming Guppy, I felt the need to include it on this list. Try using a controller for Cat Got Your Tongue if you own one, I think you'll have an easier time. It was between this, Hagalaz, and Berkano for the last spot here, and I thought that the latter two just lacked the utility that Algiz has. Algiz is not only useful as a defensive item for boss fights that will greatly aid you when playing as health lacking characters such as Keeper and The Lost, but it's also fantastic for health donation machines, devil beggars, and confessionals."
      },
      {
        "items": 943,
        "title": "Honorable Mention: Dagaz",
        "unlock": "Complete Challenge #4: Darkness Falls",
        "description": "Dagaz is definitely a great rune and serves as one of the only ways to remove curses. That being said, unlocking Darkness Falls takes too long for me to put it in this section."
      }
    ]
  },
  {
    "milestoneTitle": "The Good Ones (Part 1)",
    "bad": false,
    "milestones": [
      {
        "items": 510,
        "title": "Broken Modem",
        "unlock": "Complete seven daily challenges",
        "description": "Broken Modem is my favorite item in the entire game since it was buffed in Repentance. Whenever you pick up this item you are guaranteed to think to yourself \"Thank you, Broken Modem!\" at least once during your run because of the many helpful effects it has. Daily challenges are completely separate from the rest of the game in terms of unlocks, so you have no reason to not play a daily challenge every day until you unlock Broken Modem. "
      },
      {
        "items": 811,
        "title": "Cracked Crown",
        "unlock": "Complete five daily challenges in a row; they don't have to be consecutive days",
        "description": "While you're at Broken modem, try to get Cracked Crown as well; it's a really good stat trinket."
      },
      {
        "items": 953,
        "title": "A Card Against Humanity",
        "unlock": "Complete Challenge #12: When Life Gives You Lemons",
        "description": "This is a great and very easy unlock that can give you tons of pickups and sometimes even Petrified Poop, which is an excellent trinket. It's also very recognizable as a ground pickup so you can find it in shops easier than most cards. The challenge is unlocked by default so this unlock should be a priority."
      },
      {
        "items": 769,
        "title": "Burnt Penny",
        "unlock": "Complete Challenge #13: Beans!",
        "description": "This is a super useful penny trinket with an easy challenge unlocked by default. Why not?"
      },
      {
        "items": 240,
        "title": "Tech.5",
        "unlock": "Complete Challenge #18: The Host",
        "description": "The Host is quite an easy challenge that's unlocked by default and Tech.5 is a pretty good quality 3 item, so I think it earns a place here.\n\nAs of the latest Repentance+ patch, they've actually given Tech.5 what I consider to be a slight nerf which grants it a 5% chance to apply a Fruit Cake effect. Apparently this used to be the intended implementation of the item but was accidentally removed at some point. Since Fruit Cake has a small chance to shoot out an Ipecac tear, this also applies to Tech.5, meaning that you can damage yourself with Tech.5 unexpectedly and basically unavoidably. It's a very small chance, but as a result, I can't recommend picking this item up as either variant of The Lost as it can end your run.\n\nStill a good item. I'd be excited to see it on all other characters."
      },
      {
        "items": null,
        "title": "Azazel",
        "unlock": "Take three Devil Deals in a single run",
        "description": "You'll probably unlock him without actually trying to but I figured I'd mention him anyway. In my opinion, Azazel is the single most powerful character in the game. He is the character you'll normally want to use for non-character specific unlocks because of how powerful he is, and he is also required to unlock Satanic Bible."
      },
      {
        "items": 935,
        "title": "Ace of Clubs",
        "unlock": "Win three times in a row",
        "description": "You might get this one without trying but just in case you should try to do it as soon as you unlock Azazel as the game is going to get harder the longer you play it. Ace of Clubs is a pretty good card that can wipe a difficult room and give you a bunch of bombs."
      },
      {
        "items": 950,
        "title": "Chaos Card",
        "unlock": "Complete Challenge #9: Demo Man",
        "description": "This card single-handedly trivializes many difficult bosses in the game. It can come in as a run-winner if you manage to find it. The challenge itself is pretty easy."
      },
      {
        "items": 771,
        "title": "Counterfeit Penny",
        "unlock": "Play the Shell/Hell Game 100 times",
        "description": "At some point you're gonna have a ton of money to spend and nowhere to spend it except for a Shell Game. This is the time to unlock Counterfeit Penny, an excellent penny trinket that will greatly increase the amount of money of you gain."
      },
      {
        "items": 111,
        "title": "Mom's Knife",
        "unlock": "Defeat Satan with Isaac",
        "description": "This is one of the most powerful tear replacement items in the game. It melts bosses and will win you runs."
      },
      {
        "items": 288,
        "title": "Satanic Bible",
        "unlock": "Defeat Isaac with Azazel",
        "description": "On top of being a run-winning health item that increases your odds of making deals, Satanic Bible works well with The Lost and Tainted Lost, unlike Book of Revelations."
      },
      {
        "items": 116,
        "title": "Blood Bag",
        "unlock": "Use health donation machines 30 times",
        "description": "If you're playing the game correctly you should unlock this one without trying. On top of giving you a health up, it restores four hearts (can refill the health you just donated) and augments your speed. Also, did you know that using Spindown Dice on Blood Bag turns it into Brimstone?"
      },
      {
        "items": null,
        "title": "Store Upgrade Level 1",
        "unlock": "Donate 20 coins to the donation machine",
        "description": "Having a larger shop is going to benefit you greatly later on and the cost isn't that much all things considered."
      },
      {
        "items": 282,
        "title": "Blank Card",
        "unlock": "Defeat Isaac with Eden",
        "description": "It got nerfed pretty hard in Repentance. You can still break the game with it, though, and it has a pretty easy unlock condition."
      },
      {
        "items": null,
        "title": "Lucky Pennies",
        "unlock": "Donate two coins to the Greed Mode donation machine",
        "description": "Outside of beating Greed Mode to begin with the barrier of entry to this very good unlock is quite low. Do this while getting the next unlock."
      },
      {
        "items": null,
        "title": "Lilith",
        "unlock": "Defeat Ultra Greed or Ultra Greedier with Azazel",
        "description": "Lilith is necessary to unlock Incubus, C Section, and Twisted Pair, all of which are on this list."
      },
      {
        "items": 124,
        "title": "Forget Me Now",
        "unlock": "Defeat Satan with ???",
        "description": "A very solid item with a reasonably easy unlock condition, Forget Me Now also synergizes extremely well with 'M."
      },
      {
        "items": null,
        "title": "The Void",
        "unlock": "Defeat Hush",
        "description": "Unlocking The Void as fast as possible is going to save you a lot of hassle later on for annoying Delirium unlocks due to the mercurial nature of the portal appearing or not. You're going to need to defeat Delirium to get list inhabitants Eden's Soul and D Infinity."
      },
      {
        "items": 356,
        "title": "Incubus",
        "unlock": "Defeat Hush with Lilith",
        "description": "Incubus is an incredibly powerful item that, in essence, doubles the amount of tears you put out with no downside aside from whatever cost you paid to get it. Make this your first Hush unlock."
      },
      {
        "items": null,
        "title": "Downpour",
        "unlock": "Defeat Hush three times",
        "description": "You're gonna need this to get to Mother. Since the Chest isn't unlocked at this point, do this while going to kill Delirium with the next couple of unlocks."
      },
      {
        "items": 506,
        "title": "Delirious",
        "unlock": "Defeat Delirium",
        "description": "This item was buffed in Repentance+ and is now quite powerful. It was a mandatory unlock before anyway in spite of its limited usefulness, so it's good that I can now add it to the list as an official top tier unlock. You can get this unlock while doing the next one."
      },
      {
        "items": 485,
        "title": "D Infinity",
        "unlock": "Defeat Delirium with Isaac",
        "description": "This is the best dice item in the game. Its versatility is simply unmatched. 100% a run-winner that you should prioritize unlocking as soon as you defeat Hush."
      },
      {
        "items": 486,
        "title": "Eden's Soul",
        "unlock": "Defeat Delirium with Eden",
        "description": "This is a lot of people's favorite 12 charge active item and for good reason. It gives you two items from whatever item pool you're currently occupying, which is incredibly strong for an active item. Did I mention it synergizes very well with 'M?"
      },
      {
        "items": null,
        "title": "Magdalene",
        "unlock": "Have seven or more heart containers at once",
        "description": "You'll almost certainly get this without trying. Magdalene is required for the next two unlocks."
      },
      {
        "items": 951,
        "title": "Credit Card",
        "unlock": "Complete Challenge #10: Cursed!",
        "description": "This is a great card that can get you free items from the shop and devil deal. The only caveat is that it's pretty rare. I consider the requisite challenge to be quite easy as long as you remember to use Yum Heart when it's off cooldown."
      },
      {
        "items": 495,
        "title": "Eucharist",
        "unlock": "Defeat Delirium with Magdalene",
        "description": "Yet another great Delirium unlock with an easy character, Eucharist functions the same as Goat Head except it only makes angel rooms show up. Since angel deals are free unlike devil deals, you could argue that Eucharist is actually the better item. It will likely replace another, more immediately useful angel pool item when you find it but will more than make up for that with the items it gives you access to for the rest of your run."
      }
    ]
  },
  {
    "milestoneTitle": "The Good Ones (Part 2)",
    "bad": false,
    "milestones": [
      {
        "items": null,
        "title": "Strange Door & Jacob & Esau",
        "unlock": "Defeat Mother",
        "description": "The Strange Door is, in my opinion, the single most important unlock in the game. It opens the way to the game's final ending, so if you're just trying to \"beat\" the game it will be your last unlock before you do that. It's also required to unlock every tainted character in the game, many of which have S tier unlocks. Jacob & Esau allow you to unlock The Stairway and Birthright. You can get this unlock while doing the next one."
      },
      {
        "items": 857,
        "title": "'M",
        "unlock": "Defeat Mother with Eden",
        "description": "Fun fact: I believe this was my last (or at least close to last) normal character Mother unlock. I massively underestimated this trinket. Don't be like me. This is definitely one of the best trinkets in the game and can turn a bad active item into an extremely powerful one out of the blue, such as an R Key. On top of that, you can just drop it when you're satisfied and don't want to reroll anymore. Make this your first Mother unlock."
      },
      {
        "items": 575,
        "title": "Spirit Sword",
        "unlock": "Complete Challenge #39: Isaac's Awakening",
        "description": "Spirit Sword can win you some runs on certain characters but it's definitely not good for all of them (both variants of The Lost being key examples). It's worth unlocking for the ones that can take advantage of it. The challenge is a little difficult but nothing unbearable."
      },
      {
        "items": 323,
        "title": "The Polaroid",
        "unlock": "Defeat Isaac five times",
        "description": "Necessary to access Chest, which opens the way to all ??? unlocks, including Birthright and Blessed Penny. You should probably prioritize unlocking The Polaroid over The Negative, since Chest is an easier floor to complete than Dark Room."
      },
      {
        "items": 102,
        "title": "The D6",
        "unlock": "Defeat Isaac with ???",
        "description": "On top of being a direct upgrade for Isaac, this is one of the best active items in the game for any character that will improve the quality of your other items. Technically this can be unlocked before The Polaroid, but since you can unlock The D6 while doing the next unlock if you unlock The Polaroid first, I opted to put it here."
      },
      {
        "items": 176,
        "title": "Fate",
        "unlock": "Defeat ??? with ???",
        "description": "Pretty underrated unlock, in my opinion. It gives you flight and an eternal heart. Flight does a lot of useful stuff, such as invalidating floor obstacles and sparing some of your health when accessing a Curse Room. Azazel is the best character in the game mostly because he has flight. The more you can improve your chances of getting flight during a run the better. The fact that you can easily get Fate after unlocking The D6 lands it a place on this list."
      },
      {
        "items": 324,
        "title": "The Negative",
        "unlock": "Defeat Satan five times",
        "description": "Necessary to access Dark Room, which opens the way to all The Lamb unlocks, including Missing Poster, Curved Horn, The Soul, and Damocles."
      },
      {
        "items": 755,
        "title": "Curved Horn",
        "unlock": "Defeat The Lamb with Judas",
        "description": "This is one of the best trinkets in the game. Its simple damage up is incredibly powerful."
      },
      {
        "items": 1004,
        "title": "Bethany",
        "unlock": "Defeat Mom's Heart on Hard Mode with Lazarus without dying",
        "description": "Bethany is necessary to unlock Book of Virtues, Blessed Penny, and Revelation."
      },
      {
        "items": 580,
        "title": "Book of Virtues",
        "unlock": "Defeat Isaac with Bethany",
        "description": "Book of Virtues is a great active/passive item that improves (almost) every active item you'll get for the rest of your run. Because it's a book, it can also appear in Libraries and counts towards Bookworm."
      },
      {
        "items": 850,
        "title": "Blessed Penny",
        "unlock": "Defeat ??? with Bethany",
        "description": "This is probably the best coin trinket in the game that makes coins much more useful from Chapter 4 forward."
      },
      {
        "items": 635,
        "title": "Revelation",
        "unlock": "Defeat Mother with Bethany",
        "description": "I found this unlock to be difficult but it is well worth it. Revelation is a four-headed beast that gives you flight, two soul hearts, and the ability to fire a powerful holy laser. On top of all that, it also contributes to the Seraphim transformation.\n\nRepentance+ removed Revelation's two soul hearts, and if I'm being honest, it's a fine nerf that doesn't change the item's S tier status. I mean it's still flight, a laser, and transformation progress; you really can't go wrong with Revelation."
      },
      {
        "items": 582,
        "title": "The Stairway",
        "unlock": "Defeat Isaac with Jacob & Esau",
        "description": "Absolutely one of the best angel room items in the game that can be a definite run-winner. This will give you tons of angel room items for the rest of the run and can also enable you to get both key pieces. Get this unlock while doing the next one."
      },
      {
        "items": 613,
        "title": "Birthright",
        "unlock": "Defeat ??? with Jacob & Esau",
        "description": "Definitely one of the best items in the game hands down because of how personalized it is. This item will be a huge boon for 33/34 characters in the game. I will admit Jacob & Esau are not the easiest characters but this unlock and the previous one are probably their two easiest and they also happen to be the characters' best ones."
      },
      {
        "items": null,
        "title": "Tainted Lilith",
        "unlock": "Enter the secret closet with Lilith",
        "description": "Tainted Lilith is needed to unlock Twisted Pair, so you're gonna want her. Do this unlock while getting the next one."
      },
      {
        "items": 667,
        "title": "C Section",
        "unlock": "Defeat The Beast with Lilith",
        "description": "One of the best items in the game and probably the best tear replacement. C Section is going to win you many runs pretty much by itself and should definitely be your first unlock from defeating The Beast."
      },
      {
        "items": 687,
        "title": "Twisted Pair",
        "unlock": "Defeat The Beast with Tainted Lilith",
        "description": "Just gonna say it right here: Tainted Lilith is a very easy character and I would hope nobody disagrees with me on this one. To this effect, unlock Twisted Pair immediately after unlocking Tainted Lilith. It is basically a better Incubus that heavily ameliorates the devil deal pool and its trivial unlock condition makes it a no-brainer."
      },
      {
        "items": null,
        "title": "Tainted Isaac",
        "unlock": "Enter the secret closet with Isaac",
        "description": "5/6 of Tainted Isaac's unlocks are good and two of them made this list, so you should have this be your second tainted character unlock. Do this unlock while getting the next one."
      },
      {
        "items": 659,
        "title": "Options?",
        "unlock": "Defeat The Beast with Isaac",
        "description": "This item is heavily underrated. It basically fixes any need for pickups by itself. It also synergizes well with Broken Modem, which you either have unlocked by now or are close to unlocking. I will admit, though, this item is really only on this list because you can get it right after unlocking Tainted Isaac, so if you end up losing to Dogma or The Beast after entering the secret closet it's not a priority to go back for Options?."
      },
      {
        "items": 678,
        "title": "Glitched Crown",
        "unlock": "Defeat The Beast with Tainted Isaac",
        "description": "Once you get used to this item, it undoubtedly becomes a run-winner. Glitched Crown is absolutely one of the best unlocks in the game that is, in essence, The D6 on steroids."
      },
      {
        "items": null,
        "title": "Tainted Lazarus",
        "unlock": "Enter the secret closet with Lazarus",
        "description": "Tainted Lazarus is necessary to unlock Flip."
      },
      {
        "items": 700,
        "title": "Flip",
        "unlock": "Defeat Delirium with Tainted Lazarus",
        "description": "With the Tainted Lazarus buff in Repentance+, this unlock was made significantly easier, so it has been moved up on the list. Flip is an incredible and highly underrated item that functions as sort of a diet Damocles without the potential to instantly die while using it."
      },
      {
        "items": null,
        "title": "Tainted Azazel",
        "unlock": "Enter the secret closet with Azazel",
        "description": "Tainted Azazel is one of the most powerful characters in the game that will make your Greed mode grind easier. Lil Abaddon is fine enough to unlock afterwards, but definitely not a priority."
      },
      {
        "items": null,
        "title": "Tainted Judas",
        "unlock": "Enter the secret closet with Judas",
        "description": "Like the last unlock, Tainted Judas is one of the most powerful characters in the game that will make your Greed mode grind easier. Redemption is an inoffensive item that you will barely see after unlocking it if you manage to defeat The Beast."
      }
    ]
  },
  {
    "milestoneTitle": "The Good Ones (Part 3)",
    "bad": false,
    "milestones": [
      {
        "items": 163,
        "title": "The D20",
        "unlock": "Defeat ??? with Isaac",
        "description": "The D20 is a fairly good item in its own right, but it allows you to break the game in Greed and Greedier! mode. Notwithstanding, you should put off unlocking this item until you're planning to grind out the Greed donation machine, since Isaac's Tears, a terrible item, is also required to be unlocked to get The D20, and is, in my opinion, a net negative for Normal and Hard mode."
      },
      {
        "items": 309,
        "title": "Greedier! Mode, Holy Mantle, & Keeper",
        "unlock": "Donate 500, 879, and 1000 coins respectively to the Greed donation machine",
        "description": "This is an annoying achievement. Use Tainted Cain, Azazel, Tainted Lilith, Cain, Tainted Judas, Lilith, Tainted Magdalene, Isaac, and Tainted Azazel to get it. Don't just use one of these characters as the chance for the Greed donation machine to break permanently increases for the character you're playing whenever you donate to it. Once you unlock Holy Mantle, which is an incredible item in its own right and borderline required for The Lost, you can choose to move to the next unlocks and come back later or just finish it off. And for the record, if you cheat here I'm gonna be really disappointed in you."
      },
      {
        "items": 981,
        "title": "The Stars?",
        "unlock": "Defeat Ultra Greedier with Tainted Isaac",
        "description": "This is a great card that allows you to trade in your oldest item for two others from whatever room pool you're currently occupying (normally it's best to do this in the secret room). Greedier! mode is also easier for Tainted Isaac since there's a reroll machine provided to you so you can be quite selective with your items."
      },
      {
        "items": 743,
        "title": "Missing Poster",
        "unlock": "Defeat The Lamb with Isaac",
        "description": "This trinket is required to unlock The Lost. If you're not yet good enough to do an entire run as The Lost you can use Missing Poster to cheese some unlocks. It's also one of the only ways to revive as Tainted Lost."
      },
      {
        "items": null,
        "title": "The Lost",
        "unlock": "Die in a self-sacrifice room while holding Missing Poster",
        "description": "You're going to have to throw away a run in order to do this. Unless you're actively going for it, it's not gonna be a good feeling. Make sure you don't get teleported to Dark Room when your last heart is depleted; I speak from personal experience when I say that it will not unlock The Lost."
      },
      {
        "items": 573,
        "title": "Damocles",
        "unlock": "Defeat The Lamb with Jacob & Esau",
        "description": "To be clear, this item is pretty bad for most characters in the game. But for the very difficult characters that can't afford to take damage anyway and need it the most, Damocles can win you the run."
      },
      {
        "items": 331,
        "title": "The Soul",
        "unlock": "Defeat The Lamb with The Lost",
        "description": "Completing a Dark Room run as The Lost isn't the easiest but this item is really going to help you out for some of the hardest bosses in the game."
      },
      {
        "items": null,
        "title": "Tainted Lost",
        "unlock": "Enter the secret closet with The Lost",
        "description": "Tainted Lost is unfortunately necessary to unlock Sacred Orb."
      },
      {
        "items": 345,
        "title": "Keeper's Wooden Nickel",
        "unlock": "Defeat Isaac with Keeper",
        "description": "This makes all other Keeper unlocks much easier."
      },
      {
        "items": null,
        "title": "[Optional] Keeper's Penny",
        "unlock": "Defeat Hush with Keeper",
        "description": "This makes the rest of Keeper's unlocks easier but not as much as Wooden Nickel does. Beating Hush is also more of an ask than beating Isaac. If you're struggling to get the next two unlocks I recommend you go for this one first, but if you can get them without it then it's definitely not a priority."
      },
      {
        "items": 705,
        "title": "Keeper's Sack",
        "unlock": "Defeat Mother with Keeper",
        "description": "A difficult unlock for a fantastic item. Keeper's Sack is guaranteed to improve any run tenfold and is especially good with Tainted Keeper."
      },
      {
        "items": null,
        "title": "Tainted Keeper",
        "unlock": "Enter the secret closet with Keeper",
        "description": "Tainted Keeper makes filling up the regular donation machine easier if you haven't done that already. He is also necessary to unlock Golden Pennies."
      },
      {
        "items": 229,
        "title": "Stop Watch",
        "unlock": "Donate 999 coins to the donation machine",
        "description": "Like most items on this list, this is one of the best items in the game that not only makes everything slower but also makes you faster. Its unlock condition is kind of a pain in the ass but it's worth doing, especially because a lot of the unlocks in-between are very useful as well. Use Tainted Keeper, it will make the entire ordeal much easier. Make sure you don't donate over 999 cents to the donation machine, though, as that will instantly empty it out and prevent you from using it as a bank for future runs."
      },
      {
        "items": null,
        "title": "Apollyon",
        "unlock": "Defeat Mega Satan",
        "description": "Apollyon is necessary to unlock Void and Echo Chamber. You can do this while getting the next unlock, if you haven't done it already."
      },
      {
        "items": 395,
        "title": "Void",
        "unlock": "Defeat Delirium with Apollyon",
        "description": "This item already had game breaking potential and it received a pretty sizable buff in Repentance+ that reduced its charge time. It is now overpowered in my opinion and one of the best active items in the game that allows you to take other active items with you as well as absorb passive items for stat upgrades. This item wasn't on the list before because in the early game it was a bit cumbersome to take advantage of, but reducing its charge time fixes this."
      },
      {
        "items": null,
        "title": "Tainted Apollyon",
        "unlock": "Enter the secret closet with Apollyon",
        "description": "Tainted Apollyon is necessary to unlock Echo Chamber and Abyss."
      },
      {
        "items": 689,
        "title": "Echo Chamber",
        "unlock": "Defeat The Beast with Tainted Apollyon",
        "description": "Despite its nerf, Echo Chamber is still a juggernaut. This is a great item to have for any run and allows you to break the game."
      },
      {
        "items": 695,
        "title": "Abyss",
        "unlock": "Defeat Delirium with Tainted Apollyon",
        "description": "This item got a massive buff in Repentance+ that added a bunch of much-desired synergies and changed locust damage to depend on the quality of the item absorbed. It's now definitely worth unlocking and using."
      },
      {
        "items": null,
        "title": "Golden Pennies",
        "unlock": "Defeat Mega Satan with Tainted Keeper",
        "description": "This wasn't that hard for me to accomplish but there's a chance it'll be more difficult for you, so you might want to unlock some more coin-based items beforehand. Golden Pennies are important to have, though, as they synergize very well with coin trinkets and are in general a strong strict upgrade."
      },
      {
        "items": 558,
        "title": "Rock Bottom",
        "unlock": "Complete Boss Rush with Jacob & Esau",
        "description": "It's quite difficult to go fast with these two and survive Boss Rush, which makes this one of the most challenging unlocks in the game. It's Rock Bottom, though. The classic OP item all players love to find in their secret rooms, assuming you actually know how it works. I've put this at the (rock) bottom of the list because of its difficulty, but it's worth getting before you start doing the game's many neutral unlocks."
      },
      {
        "items": 677,
        "title": "[Optional] Inner Child",
        "unlock": "Defeat Greed with Jacob & Esau",
        "description": "On paper, this is just an extra life, which wouldn't be worth it considering the difficulty of its unlock. What makes this item special is that while playing as all tainted characters (as well as any regular character that has already unlocked their tainted counterpart), the secret closet on the Home floor will contain Inner Child instead of the tainted character unlock. For most characters, I don't think this is that important, but for the next unlock it could be worth getting."
      },
      {
        "items": 680,
        "title": "Sacred Orb",
        "unlock": "Defeat The Beast with Tainted Lost",
        "description": "Sacred Orb is one of the best items in the game that buffs your run considerably by improving the quality of items you get (with a miserably difficult unlock condition as its caveat). This should definitely be done after most of the others.\n\nRepentance+ introduced changes to Tainted Lost that somehow makes this unlock even more difficult. However, all things considered, I still think it's worth getting as it's probably the easiest and best unlock you can get with this character.\n\nThe rest of these unlocks are challenge-based and you can do them whenever you feel as though your save file has enough useful unlocks. They are direct and strong buffs to the game that have virtually no downsides."
      }
    ]
  },
  {
    "milestoneTitle": "The Bad Ones (Part 1)",
    "bad": true,
    "milestones": [
      {
        "items": 254,
        "title": "Missing No.",
        "unlock": "Complete Boss Rush with Lazarus",
        "description": "This is the worst item in the game. It has zero redeeming qualities and basically ruins any run the moment you add it to your inventory. You have to actively go out of your way to get it, so make sure you put this awful item off for as long as possible and only unlock it when you're planning on getting Mega Mush or Death Certificate."
      },
      {
        "items": 876,
        "title": "Torn Card",
        "unlock": "Defeat Mother with Tainted Lazarus",
        "description": "This trinket is so bad. It knows exactly how bad it is, too. Do yourself a favor and don't add stupid My Reflection Ipecac tears to your run."
      },
      {
        "items": 321,
        "title": "Scissors",
        "unlock": "Die 100 times",
        "description": "Ultimately, this unlock is inevitable, but because of how insufferably bad Scissors is you should try to avoid dying just so it's not added to your game."
      },
      {
        "items": 754,
        "title": "Samson's Child's Heart",
        "unlock": "Complete Challenge #34: Ultra Hard",
        "description": "The unlock from this challenge isn't worth the pain and boredom at all. Ultra Hard is the hardest and worst challenge in the entire game. By the time you beat it, you'll like the game less and be more lacking in motivation to get the rest of the unlocks. Samson is an easy character and you don't need Child's Heart to fill out his completion marks, so put off doing this mortifying challenge for as long as possible."
      },
      {
        "items": 709,
        "title": "TMTRAINER",
        "unlock": "Defeat The Beast with Tainted Eden) & Corrupted Data (Defeat Delirium with Tainted Eden",
        "description": "Two horrible unlocks for a horrible character. Not only are these difficult to get, but they add \"glitch\" items to your game, which are entirely unpredictable and can easily ruin your run after taking any of them. TMTRAINER in particular I'd consider to be one of the very worst items in the game right next to Missing No."
      },
      {
        "items": 713,
        "title": "IBS",
        "unlock": "Defeat Delirium with Tainted ???",
        "description": "This item just gets in the way and really isn't good at all. Its unlock condition sucks, too."
      },
      {
        "items": 954,
        "title": "Suicide King",
        "unlock": "Complete Challenge #7: Suicide King",
        "description": "Suicide King literally kills you. It is only good if you are playing as Lazarus, and by the time you unlock it you will probably have all his unlocks done anyway because he's an easy character. Normally, trashing an extra life just isn't worth it. The challenge is asinine and obnoxious, too. Avoid this."
      },
      {
        "items": 952,
        "title": "Rules Card",
        "unlock": "Complete Challenge #11: Glass Cannon",
        "description": "If you are the type of person that is willing to read this guide then you have essentially exhausted any sort of usefulness that Rules Card can provide. All this card does besides that is take up a spot in the card pool that could've been A Card Against Humanity or Chaos Card."
      },
      {
        "items": null,
        "title": "Re-Lax/???",
        "unlock": "Complete Challenge #25: Have a Heart",
        "description": "One of these pills is stupid while the other is quite bad and designed to troll you with its name. This challenge is not worth doing unless you're trying to get Dead God."
      },
      {
        "items": 185,
        "title": "Abel",
        "unlock": "Defeat The Lamb with Cain",
        "description": "This item is infamous for how trash it is. They even tried to buff it in Repentance but it still sucks. Do yourself a favor and put off unlocking it."
      },
      {
        "items": null,
        "title": "Sticky Nickels",
        "unlock": "Complete Boss Rush with Keeper",
        "description": "If someone asked me why I think bad unlocks are the worst thing about Isaac, this is the one I'd show them. The epitome of the asinine unlock, Sticky Nickels are supposed to replace pennies, which would've made it at least subjectively an upgrade. But instead, it replaces normal nickels, so it is an objective downgrade. The only time this unlock would be useful is if you're doing a no coin pickups challenge and you accidentally walked over it. \"That was a close one! I almost collected a coin!\"\n\nIt's still a bad unlock, but at least Repentance+ made it so that they finally replace pennies instead of nickels. Bombs cost 5 cents in the shop, normally, so if you want to blow up a sticky nickel to get 5 cents and that's a worthwhile trade for you, then go for it. The way I think about it is that since bombs cost 5 cents and sticky nickels give 5 cents when picked up, it's a net gain of -1, since they replace a penny which gives 1 cent with no strings attached. Don't unlock this one."
      },
      {
        "items": 464,
        "title": "Shade",
        "unlock": "Defeat Delirium with Judas",
        "description": "This item wouldn't be so egregious except for the fact that it occupies the Devil Deal item pool, meaning that there's a chance it can replace a much better item like Incubus or Brimstone. It can also replace a Guppy item in a red chest, which I don't think I need to elaborate on as to why that's abysmal. Unless you're playing Tainted Magdalene, avoid unlocking this."
      },
      {
        "items": 773,
        "title": "Isaac's Head",
        "unlock": "Complete Boss Rush with Isaac",
        "description": "Aggressively mid trinket, fairly easy unlock condition. Wait on unlocking this item."
      },
      {
        "items": 966,
        "title": "The High Priestess?",
        "unlock": "Defeat Ultra Greedier with Tainted Lilith",
        "description": "You remember how difficult it was unlocking The Forgotten? This card lets you relive that for a minute, and that's all it does. Just bad."
      },
      {
        "items": 974,
        "title": "Wheel of Fortune?",
        "unlock": "Defeat Ultra Greedier with Tainted Cain",
        "description": "It wouldn't be that terrible if it was just D4 as a card, but using this card is equivalent to walking into the middle of a dice room with your eyes closed. Does that sound good to you?"
      },
      {
        "items": 992,
        "title": "Soul of Judas",
        "unlock": "Complete Boss Rush and defeat Hush with Tainted Judas",
        "description": "This item makes no sense. Tainted Judas can do this every few seconds for free, so why put that power into an item that takes up a card slot and also clutters the rune pool? It's not that the rune does anything bad, per se, but like the Rules Card it hardly does anything good."
      },
      {
        "items": 946,
        "title": "Berkano",
        "unlock": "Complete Challenge #20: Purist",
        "description": "This is one of the worst runes. It hardly does anything useful compared to powerhouses like Jera or Perthro. The challenge that goes along with it is also really boring and pretty difficult, especially for inexperienced players.\n\nBerkano got a necessary buff in Repentance+ that changes its effect to giving you three Abyss locusts for the room. Not a particularly strong rune by any means but it's also not worth avoiding."
      },
      {
        "items": 316,
        "title": "???'s Only Friend",
        "unlock": "Complete Boss Rush with ???",
        "description": "It's just horribly weak and a chore to take advantage of. Why would you prioritize unlocking this?"
      },
      {
        "items": 466,
        "title": "Hushy",
        "unlock": "Defeat Hush as Apollyon",
        "description": "Not only is Hushy awful, but had there been a lack of creative bankruptcy amongst the dev team it could've even been cool.\n\nRepentance+ delivered an awesome buff for Hushy that removes him from this category. Shooting out a halo of tears is an attack that the boss version of Hush performs, so it makes sense that Hushy would do that as well. Still not one of the best unlocks, but it's no longer worth it to avoid unlocking Hushy. This is exactly the sort of buff I was hoping for."
      },
      {
        "items": 898,
        "title": "RC Remote",
        "unlock": "Defeat Isaac, ???, Satan, and The Lamb with Tainted Jacob",
        "description": "For such a difficult character with such a demanding unlock condition, you'd expect this item to be good. Nope, it's useless in 99/100 scenarios. You are polluting the trinket pool by unlocking this."
      },
      {
        "items": 279,
        "title": "The D100",
        "unlock": "Complete Boss Rush with The Lost",
        "description": "This one is gonna be controversial. I understand that this item has use, but in my opinion it's just too chaotic. All of its reroll capabilities are overshadowed by its D4 effect. In all my hours of Isaac I have never used this item. Every time I see it I'm either having a good run or a good enough run that I don't want to risk ruining it. Ask yourself this: You almost certainly already have D4 unlocked, and especially considering the difficulty of beating Boss Rush with The Lost, do you really need another active item that rerolls your inventory?"
      }
    ]
  },
  {
    "milestoneTitle": "The Bad Ones (Part 2)",
    "bad": true,
    "milestones": [
      {
        "items": null,
        "title": "Rotten Beggar",
        "unlock": "Defeat Mega Satan with Tainted Apollyon",
        "description": "Rotten Beggar easily claims its title as the worst beggar type. On top of being more unlikely to pay out with an item than other beggars, its item pool is one of the worst in the game and instead of paying out with useful pickups it tends to pay out with dubiously beneficial rotten hearts and blue flies. Also, when blown up, it tends to drop maggots instead of coins, which makes it even less useful postmortem. Absolutely one of the worst tainted character Mega Satan unlocks."
      },
      {
        "items": 634,
        "title": "Magic Skin",
        "unlock": "Defeat Mother with Jacob & Esau",
        "description": "I kinda hate this item. It's a six room charge active item that spawns an item from the current room's pool when you use it. \"Wow, a reusable Mystery Gift? That sounds awesome!\" is probably what you're thinking right now based on what I just said. Well, unfortunately, there's a catch. Every time you use it, Magic Skin steals one of your heart containers and replaces it with a broken heart (unless you're playing as either variant of The Lost, in which case it functions identically to Mystery Gift besides its charge time and quality). \"Well, that sounds like a fair drawback. I'll just use it one or two times in the angel or secret room and then drop it for a better active item.\" See, that's the thing. I wasn't being completely truthful when I said there was a catch because there are actually two catches. Magic Skin doesn't want you to drop it. After using it just once, it immediately poisons your run, and from that point onward, if you're not holding it, there is a 33% chance that it replaces any future item that you see. This chance increases to 50% after two uses and 100% after three uses. It's like they didn't even want you to use it. If you want my opinion, this secondary caveat is totally unnecessary, and it could've just been a Quality 3 item with the first drawback only and be well designed. For the reasons above, Magic Skin is incredibly dangerous to use and I generally tend to avoid it in all my runs unless I'm playing as a variant of The Lost. Using it comes with a hefty price that lowers your max health and essentially forces you to hold onto it for the rest of the run, foregoing other, much better active items. On top of all of its other problems, it also occupies the Curse Room and Red Chest item pools, meaning that it can and will replace Guppy items. Especially considering it's an alt floor Jacob & Esau unlock, I'd advise staying away from it."
      },
      {
        "items": 715,
        "title": "Ghost Bombs",
        "unlock": "Defeat Delirium with Tainted Lost",
        "description": "It's not that Ghost Bombs is bad or harmful, it's just mediocre. That alone wouldn't be enough to make it earn a spot on this list, but unlike Sacred Orb, the difficulty of Tainted Lost does not match the strength of this unlock. It's just not worth going for at all. Also, I'm choosing to omit Haunted Chests here as I consider it to be a decent unlock and you're likely to get it while going for this one."
      },
      {
        "items": 964,
        "title": "The Fool?",
        "unlock": "Defeat Ultra Greedier with Tainted Lost",
        "description": "Greedier! Mode is super difficult but can be cheesed with a few R keys. Again though, the strength of this unlock does not justify its difficulty to obtain and it's normally pretty useless unless you have some rerolling or duplication ability."
      },
      {
        "items": 888,
        "title": "Kid's Drawing",
        "unlock": "Defeat Isaac, ???, Satan, and The Lamb with Tainted Lost",
        "description": "The same type of problem as Ghost Bombs and The Fool? but arguably even worse since it's unlikely this gets unlocked with just one run. I wouldn't consider this trinket to be worth it as often you won't find two other Guppy items to go alongside it."
      },
      {
        "items": 999,
        "title": "Soul of the Lost",
        "unlock": "Defeat Hush and complete Boss Rush with Tainted Lost",
        "description": "Arguably the worst Tainted Lost unlock. Let's be real: If there was any character you'd want to go as slow as possible with it's probably Tainted Lost. You have to take your time with him or else your run can end very quickly. Boss Rush and Hush force you to move fast, making them absolute nightmares to actively go for. You'd better hope you have a really good run going already and are willing to risk it as both Boss Rush and Hush are quite difficult. Soul of the Lost as an item is decently useful and far from being the worst rune, but I can't recommend you try to go for it before most of the other unlocks in the game."
      },
      {
        "items": 436,
        "title": "Kidney Stone",
        "unlock": "Complete Challenge #29: Onan's Streak",
        "description": "Kidney Stone is fine. It's arguably a bit detrimental if you don't realize it's active but I think its positives outweigh its negatives and so I pick it up if I see it in most cases. The challenge on the other hand, sucks really bad. You start as Judas (one heart container) with Chocolate Milk and if you miss a shot, you take damage. It's an extremely difficult and frustrating challenge with a disproportionately beneficial unlock."
      },
      {
        "items": 471,
        "title": "Plan C",
        "unlock": "Defeat Ultra Greedier with Lazarus",
        "description": "This item has an extremely powerful ability that deals lethal damage to any enemy in the game. The only problem is that it kills you three seconds later. For most final bosses where this would be most useful (like Delirium), the death animation lasts too long to get the completion mark before you expire. And no, you don't get the completion mark unless that animation finishes. Most extra life items don't help either since they respawn you in the previous room, invalidating all of your progress and reviving the boss. Let's be real for a second: The use for this item is so incredibly niche you would need to intentionally set it up and carry the burden of it being in your active item slot for the rest of your run in order to possibly get any use out of it. To add insult to injury, it occupies a very large amount of item pools. It's not worth it!\n\nRepentance+ made this item 100% usable now that the kill timer is delayed so that you can still get boss completion marks. I'm still hesitant to put it up with the good unlocks simply because of its moderately difficult unlock condition, but Plan C is no longer worth avoiding."
      }
    ]
  }
]